#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform\nAcquiring state lock. This may take a few moments...
module.branch-gke-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/1026721798223]
module.branch-teams-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-teams-0]
module.branch-teams-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-teams-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-network-gcs.google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-net-0]
module.branch-dp-dev-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-dev-resman-dp-0]
module.branch-sandbox-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/1047150899812]
module.branch-gke-dev-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-dp-prod-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-dp-0]
module.branch-dp-prod-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-pf-prod-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-pf-0]
module.branch-sandbox-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-dev-resman-sbox-0]
module.branch-pf-dev-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-gke-dev-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-dev-resman-gke-0]
module.branch-pf-dev-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-dev-resman-pf-0]
module.branch-dp-dev-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-security-gcs.google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-sec-0]
module.branch-gke-prod-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-security-sa.google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-security-folder.google_folder.folder[0]: Refreshing state... [id=folders/644120496185]
module.branch-pf-prod-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.data.google_iam_policy.authoritative: Reading...
module.organization.data.google_iam_policy.authoritative: Read complete after 0s [id=2745614147]
module.branch-network-folder.google_folder.folder[0]: Refreshing state... [id=folders/157292481578]
module.branch-network-sa.google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-dp-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/1039880949360]
module.branch-sandbox-sa[0].google_service_account.service_account[0]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-sbox-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-teams-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/9953201612]
module.branch-gke-prod-gcs[0].google_storage_bucket.bucket: Refreshing state... [id=bych-prod-resman-gke-0]
module.branch-gke-dev-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-dp-prod-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-sandbox-folder[0].google_folder_organization_policy.list["constraints/compute.vmExternalIpAccess"]: Refreshing state... [id=folders/1047150899812/constraints/compute.vmExternalIpAccess]
module.branch-dp-dev-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-sandbox-folder[0].google_folder_organization_policy.boolean["constraints/sql.restrictPublicIp"]: Refreshing state... [id=folders/1047150899812/constraints/sql.restrictPublicIp]
module.branch-gke-prod-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-security-sa.google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-pf-dev-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-pf-prod-sa[0].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-network-sa.google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/bych-prod-iac-core-0/serviceAccounts/bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.branch-teams-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-teams-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-dp-prod-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-gke-dev-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-dev-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
google_organization_iam_member.org_policy_admin_dp["data-dev"]: Refreshing state... [id=203144705064/roles/orgpolicy.policyAdmin/serviceAccount:bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com/org_policy_tag_dp_scoped/Org policy tag scoped grant for data/development./resource.matchTag('203144705064/context', 'data')
&&
resource.matchTag('203144705064/environment', 'development')
]
module.branch-dp-dev-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
google_organization_iam_member.org_policy_admin_dp["data-prod"]: Refreshing state... [id=203144705064/roles/orgpolicy.policyAdmin/serviceAccount:bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com/org_policy_tag_dp_scoped/Org policy tag scoped grant for data/production./resource.matchTag('203144705064/context', 'data')
&&
resource.matchTag('203144705064/environment', 'production')
]
module.branch-gke-prod-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-security-sa.google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-pf-prod-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-pf-dev-sa[0].google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
google_organization_iam_member.org_policy_admin_pf["pf-dev"]: Refreshing state... [id=203144705064/roles/orgpolicy.policyAdmin/serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com/org_policy_tag_pf_scoped/Org policy tag scoped grant for teams/development./resource.matchTag('203144705064/context', 'teams')
&&
resource.matchTag('203144705064/environment', 'development')
]
google_organization_iam_member.org_policy_admin_pf["pf-prod"]: Refreshing state... [id=203144705064/roles/orgpolicy.policyAdmin/serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com/org_policy_tag_pf_scoped/Org policy tag scoped grant for teams/production./resource.matchTag('203144705064/context', 'teams')
&&
resource.matchTag('203144705064/environment', 'production')
]
module.branch-teams-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-teams-0/roles/storage.objectAdmin]
module.branch-gke-dev-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-dev-resman-gke-0/roles/storage.objectAdmin]
module.branch-dp-prod-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-dp-0/roles/storage.objectAdmin]
module.branch-network-sa.google_storage_bucket_iam_member.bucket-roles["bych-prod-iac-core-outputs-0-roles/storage.admin"]: Refreshing state... [id=b/bych-prod-iac-core-outputs-0/roles/storage.admin/serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-dp-dev-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-dev-resman-dp-0/roles/storage.objectAdmin]
module.branch-security-gcs.google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-sec-0/roles/storage.objectAdmin]
module.branch-pf-prod-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-pf-0/roles/storage.objectAdmin]
module.branch-pf-dev-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-dev-resman-pf-0/roles/storage.objectAdmin]
module.branch-sandbox-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-dev-resman-sbox-0/roles/storage.objectAdmin]
module.branch-network-gcs.google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-net-0/roles/storage.objectAdmin]
module.branch-teams-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/9953201612/roles/owner]
module.branch-teams-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/9953201612/roles/resourcemanager.projectCreator]
module.branch-teams-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/9953201612/roles/resourcemanager.folderAdmin]
module.branch-teams-folder[0].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"]: Refreshing state... [id=folders/9953201612/roles/compute.xpnAdmin]
module.branch-teams-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/9953201612/roles/logging.admin]
module.branch-security-folder.google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/644120496185/roles/logging.admin]
module.branch-security-folder.google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/644120496185/roles/owner]
module.branch-security-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/644120496185/roles/resourcemanager.folderAdmin]
module.branch-security-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/644120496185/roles/resourcemanager.projectCreator]
module.branch-security-folder.google_folder_iam_binding.authoritative["roles/viewer"]: Refreshing state... [id=folders/644120496185/roles/viewer]
module.branch-gke-prod-gcs[0].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"]: Refreshing state... [id=b/bych-prod-resman-gke-0/roles/storage.objectAdmin]
module.branch-gke-dev-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/962745840450]
module.branch-gke-prod-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/434371292964]
module.branch-sandbox-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/1047150899812/roles/logging.admin]
module.branch-sandbox-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/1047150899812/roles/owner]
module.branch-sandbox-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/1047150899812/roles/resourcemanager.folderAdmin]
module.branch-sandbox-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/1047150899812/roles/resourcemanager.projectCreator]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/editor"]: Refreshing state... [id=folders/157292481578/roles/editor]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/157292481578/roles/resourcemanager.folderAdmin]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/157292481578/roles/resourcemanager.projectCreator]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"]: Refreshing state... [id=folders/157292481578/roles/compute.xpnAdmin]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/157292481578/roles/owner]
module.branch-network-folder.google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/157292481578/roles/logging.admin]
module.branch-dp-prod-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/1025010153402]
module.branch-dp-dev-folder[0].google_folder.folder[0]: Refreshing state... [id=folders/768822674087]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-dev-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-dev-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-dev-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/compute.xpnAdmin-serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/compute.xpnAdmin/serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-prod-resman-dp-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-prod-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-prod-resman-gke-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.costsManager-serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.costsManager/serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.costsManager-serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.costsManager/serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/accesscontextmanager.policyAdmin-serviceAccount:bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/accesscontextmanager.policyAdmin/serviceAccount:bych-prod-resman-sec-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/billing.user-serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/billing.user/serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.organization.google_organization_iam_member.additive["roles/compute.orgFirewallPolicyAdmin-serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com"]: Refreshing state... [id=203144705064/roles/compute.orgFirewallPolicyAdmin/serviceAccount:bych-prod-resman-net-0@bych-prod-iac-core-0.iam.gserviceaccount.com]
module.branch-gke-dev-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/962745840450/roles/logging.admin]
module.branch-gke-dev-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/962745840450/roles/owner]
module.branch-gke-dev-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/962745840450/roles/resourcemanager.folderAdmin]
module.branch-gke-dev-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/962745840450/roles/resourcemanager.projectCreator]
module.branch-gke-dev-folder[0].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"]: Refreshing state... [id=folders/962745840450/roles/compute.xpnAdmin]
module.branch-gke-prod-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/434371292964/roles/resourcemanager.projectCreator]
module.branch-gke-prod-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/434371292964/roles/logging.admin]
module.branch-gke-prod-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/434371292964/roles/owner]
module.branch-gke-prod-folder[0].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"]: Refreshing state... [id=folders/434371292964/roles/compute.xpnAdmin]
module.branch-gke-prod-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/434371292964/roles/resourcemanager.folderAdmin]
module.branch-dp-prod-folder[0].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"]: Refreshing state... [id=folders/1025010153402/organizations/203144705064/roles/serviceProjectNetworkAdmin]
module.branch-dp-prod-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/1025010153402/roles/resourcemanager.folderAdmin]
module.branch-dp-prod-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/1025010153402/roles/resourcemanager.projectCreator]
module.branch-dp-prod-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/1025010153402/roles/logging.admin]
module.branch-dp-prod-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/1025010153402/roles/owner]
module.branch-dp-dev-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"]: Refreshing state... [id=folders/768822674087/roles/resourcemanager.projectCreator]
module.branch-dp-dev-folder[0].google_folder_iam_binding.authoritative["roles/logging.admin"]: Refreshing state... [id=folders/768822674087/roles/logging.admin]
module.branch-dp-dev-folder[0].google_folder_iam_binding.authoritative["roles/owner"]: Refreshing state... [id=folders/768822674087/roles/owner]
module.branch-dp-dev-folder[0].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"]: Refreshing state... [id=folders/768822674087/organizations/203144705064/roles/serviceProjectNetworkAdmin]
module.branch-dp-dev-folder[0].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=folders/768822674087/roles/resourcemanager.folderAdmin]
module.branch-network-dev-folder.google_folder.folder[0]: Refreshing state... [id=folders/345748173758]
module.branch-network-prod-folder.google_folder.folder[0]: Refreshing state... [id=folders/732182688646]
google_storage_bucket_object.providers["03-teams"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-teams-providers.tf]
google_storage_bucket_object.providers["03-data-platform-dev"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-data-platform-dev-providers.tf]
google_storage_bucket_object.providers["03-project-factory-prod"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-project-factory-prod-providers.tf]
google_storage_bucket_object.providers["02-networking"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/02-networking-providers.tf]
google_storage_bucket_object.providers["99-sandbox"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/99-sandbox-providers.tf]
google_storage_bucket_object.providers["02-security"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/02-security-providers.tf]
google_storage_bucket_object.providers["03-data-platform-prod"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-data-platform-prod-providers.tf]
google_storage_bucket_object.providers["03-gke-prod"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-gke-prod-providers.tf]
google_storage_bucket_object.providers["03-gke-dev"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-gke-dev-providers.tf]
google_storage_bucket_object.providers["03-project-factory-dev"]: Refreshing state... [id=bych-prod-iac-core-outputs-0-providers/03-project-factory-dev-providers.tf]
module.branch-network-dev-folder.google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"]: Refreshing state... [id=folders/345748173758/organizations/203144705064/roles/serviceProjectNetworkAdmin]
module.branch-network-prod-folder.google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"]: Refreshing state... [id=folders/732182688646/organizations/203144705064/roles/serviceProjectNetworkAdmin]
module.organization.google_organization_policy.list["constraints/compute.vmExternalIpAccess"]: Refreshing state... [id=203144705064/constraints/compute.vmExternalIpAccess]
module.organization.google_organization_policy.list["constraints/iam.allowedPolicyMemberDomains"]: Refreshing state... [id=203144705064/constraints/iam.allowedPolicyMemberDomains]
module.organization.google_organization_policy.list["constraints/compute.restrictLoadBalancerCreationForTypes"]: Refreshing state... [id=203144705064/constraints/compute.restrictLoadBalancerCreationForTypes]
module.organization.google_organization_policy.list["constraints/run.allowedIngress"]: Refreshing state... [id=203144705064/constraints/run.allowedIngress]
module.organization.google_tags_tag_key.default["context"]: Refreshing state... [id=tagKeys/736785641857]
module.organization.google_organization_policy.boolean["constraints/storage.uniformBucketLevelAccess"]: Refreshing state... [id=203144705064/constraints/storage.uniformBucketLevelAccess]
module.organization.google_tags_tag_key.default["environment"]: Refreshing state... [id=tagKeys/12953263728]
module.organization.google_organization_policy.boolean["constraints/iam.automaticIamGrantsForDefaultServiceAccounts"]: Refreshing state... [id=203144705064/constraints/iam.automaticIamGrantsForDefaultServiceAccounts]
module.organization.google_organization_policy.boolean["constraints/sql.restrictPublicIp"]: Refreshing state... [id=203144705064/constraints/sql.restrictPublicIp]
module.organization.google_organization_policy.boolean["constraints/iam.disableServiceAccountKeyCreation"]: Refreshing state... [id=203144705064/constraints/iam.disableServiceAccountKeyCreation]
module.organization.google_organization_policy.boolean["constraints/sql.restrictAuthorizedNetworks"]: Refreshing state... [id=203144705064/constraints/sql.restrictAuthorizedNetworks]
module.organization.google_organization_policy.boolean["constraints/compute.requireOsLogin"]: Refreshing state... [id=203144705064/constraints/compute.requireOsLogin]
module.organization.google_organization_policy.boolean["constraints/compute.skipDefaultNetworkCreation"]: Refreshing state... [id=203144705064/constraints/compute.skipDefaultNetworkCreation]
module.organization.google_tags_tag_value.default["context/gke"]: Refreshing state... [id=tagValues/569986171689]
module.organization.google_tags_tag_value.default["environment/development"]: Refreshing state... [id=tagValues/1044353739223]
module.organization.google_tags_tag_value.default["environment/production"]: Refreshing state... [id=tagValues/363082134574]
module.organization.google_tags_tag_value.default["context/sandbox"]: Refreshing state... [id=tagValues/185856874429]
module.organization.google_tags_tag_value.default["context/networking"]: Refreshing state... [id=tagValues/950306704297]
module.organization.google_tags_tag_value.default["context/security"]: Refreshing state... [id=tagValues/333057576904]
module.organization.google_tags_tag_value.default["context/teams"]: Refreshing state... [id=tagValues/1059932371858]
module.organization.google_tags_tag_value.default["context/data"]: Refreshing state... [id=tagValues/386009243623]
module.branch-security-folder.google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F644120496185/tagValues/333057576904]
module.branch-network-prod-folder.google_tags_tag_binding.binding["environment"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F732182688646/tagValues/363082134574]
module.branch-dp-dev-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F768822674087/tagValues/1044353739223]
module.branch-teams-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F9953201612/tagValues/1059932371858]
module.branch-gke-prod-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F434371292964/tagValues/363082134574]
module.branch-network-dev-folder.google_tags_tag_binding.binding["environment"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F345748173758/tagValues/1044353739223]
module.branch-gke-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1026721798223/tagValues/569986171689]
module.branch-network-folder.google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F157292481578/tagValues/950306704297]
module.branch-dp-prod-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1025010153402/tagValues/363082134574]
module.branch-dp-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1039880949360/tagValues/386009243623]
module.branch-gke-dev-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F962745840450/tagValues/1044353739223]
module.branch-sandbox-folder[0].google_tags_tag_binding.binding["context"]: Refreshing state... [id=tagBindings/%2F%2Fcloudresourcemanager.googleapis.com%2Ffolders%2F1047150899812/tagValues/185856874429]
google_storage_bucket_object.tfvars: Refreshing state... [id=bych-prod-iac-core-outputs-0-tfvars/01-resman.auto.tfvars.json]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.branch-dp-dev-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-dev-resman-dp-0"
      + labels                      = {}
        name                        = "bych-dev-resman-dp-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-dp-prod-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-dp-0"
      + labels                      = {}
        name                        = "bych-prod-resman-dp-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-gke-dev-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-dev-resman-gke-0"
      + labels                      = {}
        name                        = "bych-dev-resman-gke-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-gke-prod-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-gke-0"
      + labels                      = {}
        name                        = "bych-prod-resman-gke-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-network-gcs.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-net-0"
      + labels                      = {}
        name                        = "bych-prod-resman-net-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-pf-dev-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-dev-resman-pf-0"
      + labels                      = {}
        name                        = "bych-dev-resman-pf-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-pf-prod-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-pf-0"
      + labels                      = {}
        name                        = "bych-prod-resman-pf-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-sandbox-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-dev-resman-sbox-0"
      + labels                      = {}
        name                        = "bych-dev-resman-sbox-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-security-gcs.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-sec-0"
      + labels                      = {}
        name                        = "bych-prod-resman-sec-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.branch-teams-gcs[0].google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "bych-prod-resman-teams-0"
      + labels                      = {}
        name                        = "bych-prod-resman-teams-0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.organization.google_tags_tag_key.default["context"] has changed
  ~ resource "google_tags_tag_key" "default" {
        id              = "tagKeys/736785641857"
        name            = "736785641857"
        # (6 unchanged attributes hidden)
    }

  # module.organization.google_tags_tag_key.default["environment"] has changed
  ~ resource "google_tags_tag_key" "default" {
        id              = "tagKeys/12953263728"
        name            = "12953263728"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.providers["03-teams-team-a"] will be created
  + resource "google_storage_bucket_object" "providers" {
      + bucket         = "bych-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/03-teams-team-a-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.providers["03-teams-team-b"] will be created
  + resource "google_storage_bucket_object" "providers" {
      + bucket         = "bych-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/03-teams-team-b-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.tfvars must be replaced
-/+ resource "google_storage_bucket_object" "tfvars" {
      ~ content          = (sensitive value) # forces replacement
      ~ content_type     = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c           = "lhurBQ==" -> (known after apply)
      ~ detect_md5hash   = "26wxmQT+tKLDqKpyeUDlOA==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "bych-prod-iac-core-outputs-0-tfvars/01-resman.auto.tfvars.json" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "26wxmQT+tKLDqKpyeUDlOA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/bych-prod-iac-core-outputs-0/o/tfvars%2F01-resman.auto.tfvars.json?generation=1664572912328817&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "tfvars/01-resman.auto.tfvars.json"
      ~ output_name      = "tfvars/01-resman.auto.tfvars.json" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/bych-prod-iac-core-outputs-0/o/tfvars%2F01-resman.auto.tfvars.json" -> (known after apply)
      ~ storage_class    = "MULTI_REGIONAL" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Development"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/203144705064/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-dev-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-dev-folder["team-a"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/1044353739223"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Development"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/203144705064/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-dev-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-dev-folder["team-b"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/1044353739223"
    }

  # module.branch-teams-team-folder["team-a"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Team A"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "folders/9953201612"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/compute.xpnAdmin"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-folder["team-a"].google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:team-a@bychkow.ski",
        ]
      + role    = "roles/viewer"
    }

  # module.branch-teams-team-folder["team-b"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Team B"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "folders/9953201612"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/compute.xpnAdmin"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-folder["team-b"].google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:team-b@bychkow.ski",
        ]
      + role    = "roles/viewer"
    }

  # module.branch-teams-team-gcs["team-a"].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "bych-prod-teams-team-a-0"
      + project                     = "bych-prod-iac-core-0"
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.branch-teams-team-gcs["team-a"].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "bindings" {
      + bucket  = "bych-prod-teams-team-a-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.branch-teams-team-gcs["team-b"].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "bych-prod-teams-team-b-0"
      + project                     = "bych-prod-iac-core-0"
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.branch-teams-team-gcs["team-b"].google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "bindings" {
      + bucket  = "bych-prod-teams-team-b-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Production"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/203144705064/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-prod-folder["team-a"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/363082134574"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Production"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder_iam_binding.authoritative["organizations/203144705064/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "organizations/203144705064/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:bych-prod-resman-pf-0@bych-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-teams-team-prod-folder["team-b"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/363082134574"
    }

  # module.branch-teams-team-sa["team-a"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "bych-prod-teams-team-a-0"
      + description  = "Terraform team team-a service account."
      + disabled     = false
      + display_name = "Terraform-managed."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "bych-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.branch-teams-team-sa["team-a"].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "roles" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "group:team-a-admins@bychkow.ski",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.branch-teams-team-sa["team-b"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "bych-prod-teams-team-b-0"
      + description  = "Terraform team team-b service account."
      + disabled     = false
      + display_name = "Terraform-managed."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "bych-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.branch-teams-team-sa["team-b"].google_service_account_iam_binding.roles["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "roles" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "group:team-b-admins@bychkow.ski",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

Plan: 53 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ providers = (sensitive value)
  ~ teams     = {
      + team-a = {
          + folder          = (known after apply)
          + gcs_bucket      = "bych-prod-teams-team-a-0"
          + service_account = "bych-prod-teams-team-a-0@bych-prod-iac-core-0.iam.gserviceaccount.com"
        }
      + team-b = {
          + folder          = (known after apply)
          + gcs_bucket      = "bych-prod-teams-team-b-0"
          + service_account = "bych-prod-teams-team-b-0@bych-prod-iac-core-0.iam.gserviceaccount.com"
        }
    }
  ~ tfvars    = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
Releasing state lock. This may take a few moments...

```

</details>

#### Terraform Apply 📖`skipped`

*Pusher: @mbychkowski, Action: `pull_request`, Working Directory: ``, Workflow: `FAST resman stage`*